In [1]:
import pandas as pd

In [9]:
# some sample data
df = pd.DataFrame({'A':[1, 2, 3], 
                   'B':[['a','b','c'],
                        ['d','e','f'],
                        ['g','h','i']]})

In [10]:
df

   A          B
0  1  [a, b, c]
1  2  [d, e, f]
2  3  [g, h, i]

In [15]:
# we would like to expand the values in column B into multiple rows

In [21]:
# each row into a Series
t1 = df.apply(lambda row: pd.Series(row['B']), axis=1)
t1

   0  1  2
0  a  b  c
1  d  e  f
2  g  h  i

In [22]:
# convert columns to index
t2 = t1.stack()
t2

0  0    a
   1    b
   2    c
1  0    d
   1    e
   2    f
2  0    g
   1    h
   2    i
dtype: object

In [39]:
# check the index  - it is  a MultiIndex
t2.index

MultiIndex([(0, 0),
            (0, 1),
            (0, 2),
            (1, 0),
            (1, 1),
            (1, 2),
            (2, 0),
            (2, 1),
            (2, 2)],
           )

In [45]:
# reset index so that it can match up with the original df's index
t3 = t2.reset_index(level=1, drop=True)
t3

0    a
0    b
0    c
1    d
1    e
1    f
2    g
2    h
2    i
dtype: object

In [49]:
t3.name='unrolled_B' # set a name; if not exception will be thrown

df1 = df.join(t3)
df1

   A          B unrolled_B
0  1  [a, b, c]          a
0  1  [a, b, c]          b
0  1  [a, b, c]          c
1  2  [d, e, f]          d
1  2  [d, e, f]          e
1  2  [d, e, f]          f
2  3  [g, h, i]          g
2  3  [g, h, i]          h
2  3  [g, h, i]          i

In [50]:
# removing column B is optional
df1.drop(columns='B')

   A unrolled_B
0  1          a
0  1          b
0  1          c
1  2          d
1  2          e
1  2          f
2  3          g
2  3          h
2  3          i